app/controllers/schools_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 11]]
---
  def show
    @school = School.find(params[:id])
    @students = Student.all

INSERT INTO "schools" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a new school name"], ["address", "234234"], ["created_at", "2019-11-22 19:28:56.689864"], ["updated_at", "2019-11-22 19:28:56.689864"]]
---
  def create
    school = School.new(school_params)
    if school.valid?
      school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "schools" SET "name" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["name", "Flatirn School"], ["updated_at", "2019-11-22 18:00:58.581913"], ["id", 11]]
---
  def update
    school = School.find(params[:id])
    school.update(school_params)

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 16]]
---
  def delete
    school = School.find(params[:id])
    school.destroy