app/controllers/students_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @student = Student.new
    @schools = School.all

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "hasibul"], ["age", 100], ["created_at", "2019-11-22 19:43:56.140779"], ["updated_at", "2019-11-22 19:43:56.140779"], ["school_id", 15]]
---
  def create
    student = Student.new(student_params)
    if student.valid?
      student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Beto O'Rourke"], ["age", 47], ["updated_at", "2019-11-22 16:51:56.735577"], ["id", 5]]
---
  def update
    student = Student.find(params[:id])
    student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 9]]
---
  def delete
    student = Student.find(params[:id])
    student.destroy