app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "jonah"], ["email", "j@j.com"], ["message", "help me"], ["created_at", "2019-11-22 20:40:21.480719"], ["updated_at", "2019-11-22 20:40:21.480719"]]
---
    def create
        user = User.create(user_params)